blogs/why-use-nc-mock-redis-client-get-nothing.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>使用nc模拟redis-cli为什么会失败</title>
<!-- 2016-04-01 五 18:45 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="root" />
<link rel="stylesheet" type="text/css" href="/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">使用nc模拟redis-cli为什么会失败</h1>
<p>
今天需要操作redis，但是机器上没有redis-cli，我决定秀一下我最喜欢的nc， <code>echo get a | nc redis.server 6379</code> ，居然失败了，什么都没有返回，而a是有值的呀！自尊心受到100点伤害！
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 用nc的正确姿势</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #ffff00;"># </span><span style="color: #ffff00;">echo set a HI | nc redis.server 6379</span>
<span style="color: #ffff00;"># </span><span style="color: #ffff00;">echo get a | nc redis.server 6379</span>
<span style="color: #ffff00;"># </span><span style="color: #ffff00;">nc redis.server 6379</span>
get a
$<span style="color: #ffff00;">2</span>
HI
</pre>
</div>

<p>
几点疑问？
</p>
<ol class="org-ol">
<li>set 成功了
</li>
<li>nc 从管道读命令，get失败。换成STDIN重定向也一样。
</li>
<li>nc 从货真价实的STDIN读命令，get成功。
</li>
</ol>

<p>
更可气的是 <code>echo get a | nc redis.server</code> 居然偶尔也能成功一次，到底哪里出了问题？
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> tcpdump 出马</h2>
<div class="outline-text-2" id="text-2">
<p>
用tcpdump查看失败和成功时的网络流量（只保留了关键数据）。
</p>
<pre class="example">
dev.62291 &gt; redis.server.6379: Flags [P.]
get a

dev.62291 &gt; redis.server.6379: Flags [F.]


dev.62554 &gt; redis.server.6379: Flags [P.]
get a

redis.server.6379 &gt; dev.62554: Flags [.]
</pre>

<p>
一对比，惊呆了，失败时，竟然没有等redis应答，就发了fin包，主动关闭连接，看到这里，原因就很清楚了。
</p>

<p>
nc 从管道或重定向读取数据，读到了EOF时（echo结束或是文件结尾），就关掉了自己的写端 <code>shutdown(3, SHUT_WR)</code> 。这时候redis发现了这一点，就把自己也关掉了，于是读取失败。偶尔redis会在发送完请求的数据，才发现nc关掉了自己的写端，此时nc就成功读到了数据。
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 换个姿势，搞定</h2>
<div class="outline-text-2" id="text-3">
<p>
<code>cat &lt;(echo get a) - | nc server.host 6379</code> 这样，我们可以保持STDIN不关闭，nc也就不会自动断开连接了。
</p>

<p>
感觉这个是redis实现的一个问题。
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: root</p>
<p class="date">Created: 2016-04-01 五 18:45</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.4.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
